./2048
#################################
##       2048-game Engine      ##
#################################

2048> The current state is:
---------------------------------
|	|	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|4	|	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------

2048> Enter a command:
----> keyword keyword . 2048> Moved left using addition. Random tile added.
2048> The current state is:
---------------------------------
|	|	|	|4	|
---------------------------------
|	|	|	|	|
---------------------------------
|4	|	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword keyword . 2048> Moved right using subtraction. Random tile added.
2048> The current state is:
---------------------------------
|	|	|	|4	|
---------------------------------
|	|	|	|	|
---------------------------------
|	|	|	|4	|
---------------------------------
|	|	|2	|	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword keyword . 2048> Moved up using multiplication. Random tile added.
2048> The current state is:
---------------------------------
|	|2	|2	|16	|
---------------------------------
|	|	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword keyword . 2048> Moved down using division. Random tile added.
2048> The current state is:
---------------------------------
|	|	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|2	|2	|2	|16	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword integer keyword integer , integer . 2048> Assigned the value 9 to <1,1>.
2048> The current state is:
---------------------------------
|9	|	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|2	|2	|2	|16	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword integer keyword integer , integer . 2048> Assigned the value 3 to <2,1>.
2048> The current state is:
---------------------------------
|9	|	|	|	|
---------------------------------
|3	|	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|2	|2	|2	|16	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword integer keyword integer , integer . 2048> Assigned the value 3 to <2,2>.
2048> The current state is:
---------------------------------
|9	|	|	|	|
---------------------------------
|3	|3	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|2	|2	|2	|16	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword identifier keyword integer , integer . 2048> Tile <2,1> named as "var".
2048> The current state is:
---------------------------------
|9	|	|	|	|
---------------------------------
|3	|3	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|2	|2	|2	|16	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword identifier keyword integer , integer . 2048> Tile <2,1> named as "var1".
2048> The current state is:
---------------------------------
|9	|	|	|	|
---------------------------------
|3	|3	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|2	|2	|2	|16	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword identifier keyword integer , integer . ERROR: Variable redeclaration.
2048> Tile <2,2> named as "var".
2048> The current state is:
---------------------------------
|9	|	|	|	|
---------------------------------
|3	|3	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|2	|2	|2	|16	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword identifier keyword integer , integer . 2048> Tile <1,1> named as "var_".
2048> The current state is:
---------------------------------
|9	|	|	|	|
---------------------------------
|3	|3	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
|2	|2	|2	|16	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword keyword . 2048> Moved left using multiplication. Random tile added.
2048> The current state is:
---------------------------------
|9	|	|	|	|
---------------------------------
|9	|	|	|	|
---------------------------------
|2	|	|	|	|
---------------------------------
|4	|2	|16	|	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword keyword . 2048> Moved up using subtraction. Random tile added.
2048> The current state is:
---------------------------------
|2	|2	|16	|	|
---------------------------------
|4	|	|	|	|
---------------------------------
|	|2	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword identifier keyword integer , integer . 2048> Tile <1,1> named as "var123".
2048> The current state is:
---------------------------------
|2	|2	|16	|	|
---------------------------------
|4	|	|	|	|
---------------------------------
|	|2	|	|	|
---------------------------------
|	|	|	|	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> keyword keyword integer , integer . 2048> Value in <1,1> is 2
\n
[break] status: 0

2048> Enter a command:
----> keyword keyword keyword integer , integer 2048> Value in <1,1> is 2
keyword integer , integer . 2048> Assigned the value 2 to <4,4>.
2048> The current state is:
---------------------------------
|2	|2	|16	|	|
---------------------------------
|4	|	|	|	|
---------------------------------
|	|2	|	|	|
---------------------------------
|	|	|	|2	|
---------------------------------
\n
[break] status: 0

2048> Enter a command:
----> EOF
[break] status: 1
